node {
  name: "learning_rate"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
}
node {
  name: "X"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1728
        }
      }
    }
  }
}
node {
  name: "Y"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 72
        }
      }
    }
  }
}
node {
  name: "is_training"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\300\006\000\000\310\000\000\000"
      }
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.032207831740379333
      }
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "hidden_0/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "hidden_0/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "hidden_0/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
}
node {
  name: "hidden_0/weights/Initializer/truncated_normal"
  op: "Add"
  input: "hidden_0/weights/Initializer/truncated_normal/mul"
  input: "hidden_0/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
}
node {
  name: "hidden_0/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1728
        }
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/weights/Assign"
  op: "Assign"
  input: "hidden_0/weights"
  input: "hidden_0/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/weights/read"
  op: "Identity"
  input: "hidden_0/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/weights"
      }
    }
  }
}
node {
  name: "hidden_0/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_0/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/biases/Assign"
  op: "Assign"
  input: "hidden_0/biases"
  input: "hidden_0/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/biases/read"
  op: "Identity"
  input: "hidden_0/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/biases"
      }
    }
  }
}
node {
  name: "hidden_0/MatMul"
  op: "MatMul"
  input: "X"
  input: "hidden_0/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_0/add"
  op: "AddV2"
  input: "hidden_0/MatMul"
  input: "hidden_0/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/bn_0/gamma/Assign"
  op: "Assign"
  input: "hidden_0/bn_0/gamma"
  input: "hidden_0/bn_0/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/gamma/read"
  op: "Identity"
  input: "hidden_0/bn_0/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/gamma"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/bn_0/beta/Assign"
  op: "Assign"
  input: "hidden_0/bn_0/beta"
  input: "hidden_0/bn_0/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/beta/read"
  op: "Identity"
  input: "hidden_0/bn_0/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/beta"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_mean/Assign"
  op: "Assign"
  input: "hidden_0/bn_0/moving_mean"
  input: "hidden_0/bn_0/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_mean/read"
  op: "Identity"
  input: "hidden_0/bn_0/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 200
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_variance/Assign"
  op: "Assign"
  input: "hidden_0/bn_0/moving_variance"
  input: "hidden_0/bn_0/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/moving_variance/read"
  op: "Identity"
  input: "hidden_0/bn_0/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/mean"
  op: "Mean"
  input: "hidden_0/add"
  input: "hidden_0/bn_0/moments/mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/StopGradient"
  op: "StopGradient"
  input: "hidden_0/bn_0/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "hidden_0/add"
  input: "hidden_0/bn_0/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/variance/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/variance"
  op: "Mean"
  input: "hidden_0/bn_0/moments/SquaredDifference"
  input: "hidden_0/bn_0/moments/variance/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/Squeeze"
  op: "Squeeze"
  input: "hidden_0/bn_0/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/moments/Squeeze_1"
  op: "Squeeze"
  input: "hidden_0/bn_0/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/switch_t"
  op: "Identity"
  input: "hidden_0/bn_0/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/switch_f"
  op: "Identity"
  input: "hidden_0/bn_0/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/moments/Squeeze"
  input: "hidden_0/bn_0/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moments/Squeeze"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/Switch_2"
  op: "Switch"
  input: "hidden_0/bn_0/moving_mean/read"
  input: "hidden_0/bn_0/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond/Merge"
  op: "Merge"
  input: "hidden_0/bn_0/cond/Switch_2"
  input: "hidden_0/bn_0/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/switch_t"
  op: "Identity"
  input: "hidden_0/bn_0/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/switch_f"
  op: "Identity"
  input: "hidden_0/bn_0/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/moments/Squeeze_1"
  input: "hidden_0/bn_0/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moments/Squeeze_1"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/Switch_2"
  op: "Switch"
  input: "hidden_0/bn_0/moving_variance/read"
  input: "hidden_0/bn_0/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_1/Merge"
  op: "Merge"
  input: "hidden_0/bn_0/cond_1/Switch_2"
  input: "hidden_0/bn_0/cond_1/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/switch_t"
  op: "Identity"
  input: "hidden_0/bn_0/cond_2/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/switch_f"
  op: "Identity"
  input: "hidden_0/bn_0/cond_2/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/decay"
  op: "Const"
  input: "^hidden_0/bn_0/cond_2/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub"
  op: "Sub"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub/Switch:1"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "hidden_0/bn_0/moving_mean/read"
  input: "hidden_0/bn_0/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/cond/Merge"
  input: "hidden_0/bn_0/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/cond/Merge"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/mul"
  op: "Mul"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/sub"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg"
  op: "AssignSub"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/Switch:1"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "hidden_0/bn_0/moving_mean"
  input: "hidden_0/bn_0/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/moving_mean/read"
  input: "hidden_0/bn_0/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_2/Merge"
  op: "Merge"
  input: "hidden_0/bn_0/cond_2/Switch_1"
  input: "hidden_0/bn_0/cond_2/AssignMovingAvg"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/switch_t"
  op: "Identity"
  input: "hidden_0/bn_0/cond_3/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/switch_f"
  op: "Identity"
  input: "hidden_0/bn_0/cond_3/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/decay"
  op: "Const"
  input: "^hidden_0/bn_0/cond_3/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub"
  op: "Sub"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub/Switch:1"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "hidden_0/bn_0/moving_variance/read"
  input: "hidden_0/bn_0/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/cond_1/Merge"
  input: "hidden_0/bn_0/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/cond_1/Merge"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/mul"
  op: "Mul"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/sub"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg"
  op: "AssignSub"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/Switch:1"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "hidden_0/bn_0/moving_variance"
  input: "hidden_0/bn_0/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/Switch_1"
  op: "Switch"
  input: "hidden_0/bn_0/moving_variance/read"
  input: "hidden_0/bn_0/cond_3/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_0/bn_0/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/cond_3/Merge"
  op: "Merge"
  input: "hidden_0/bn_0/cond_3/Switch_1"
  input: "hidden_0/bn_0/cond_3/AssignMovingAvg"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/add/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0010000000474974513
      }
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/add"
  op: "AddV2"
  input: "hidden_0/bn_0/cond_1/Merge"
  input: "hidden_0/bn_0/batchnorm/add/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/Rsqrt"
  op: "Rsqrt"
  input: "hidden_0/bn_0/batchnorm/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/mul"
  op: "Mul"
  input: "hidden_0/bn_0/batchnorm/Rsqrt"
  input: "hidden_0/bn_0/gamma/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/mul_1"
  op: "Mul"
  input: "hidden_0/add"
  input: "hidden_0/bn_0/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/mul_2"
  op: "Mul"
  input: "hidden_0/bn_0/cond/Merge"
  input: "hidden_0/bn_0/batchnorm/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/sub"
  op: "Sub"
  input: "hidden_0/bn_0/beta/read"
  input: "hidden_0/bn_0/batchnorm/mul_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/bn_0/batchnorm/add_1"
  op: "AddV2"
  input: "hidden_0/bn_0/batchnorm/mul_1"
  input: "hidden_0/bn_0/batchnorm/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_0/Relu"
  op: "Relu"
  input: "hidden_0/bn_0/batchnorm/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\310\000\000\000P\000\000\000"
      }
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal/mean"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal/stddev"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.08451542258262634
      }
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal/TruncatedNormal"
  op: "TruncatedNormal"
  input: "hidden_1/weights/Initializer/truncated_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal/mul"
  op: "Mul"
  input: "hidden_1/weights/Initializer/truncated_normal/TruncatedNormal"
  input: "hidden_1/weights/Initializer/truncated_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
}
node {
  name: "hidden_1/weights/Initializer/truncated_normal"
  op: "Add"
  input: "hidden_1/weights/Initializer/truncated_normal/mul"
  input: "hidden_1/weights/Initializer/truncated_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
}
node {
  name: "hidden_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 200
        }
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/weights/Assign"
  op: "Assign"
  input: "hidden_1/weights"
  input: "hidden_1/weights/Initializer/truncated_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/weights/read"
  op: "Identity"
  input: "hidden_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/weights"
      }
    }
  }
}
node {
  name: "hidden_1/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/biases"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_1/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/biases"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/biases/Assign"
  op: "Assign"
  input: "hidden_1/biases"
  input: "hidden_1/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/biases"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/biases/read"
  op: "Identity"
  input: "hidden_1/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/biases"
      }
    }
  }
}
node {
  name: "hidden_1/MatMul"
  op: "MatMul"
  input: "hidden_0/Relu"
  input: "hidden_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_1/add"
  op: "AddV2"
  input: "hidden_1/MatMul"
  input: "hidden_1/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/bn_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/bn_1/gamma/Assign"
  op: "Assign"
  input: "hidden_1/bn_1/gamma"
  input: "hidden_1/bn_1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/gamma/read"
  op: "Identity"
  input: "hidden_1/bn_1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/gamma"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/bn_1/beta/Assign"
  op: "Assign"
  input: "hidden_1/bn_1/beta"
  input: "hidden_1/bn_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/beta/read"
  op: "Identity"
  input: "hidden_1/bn_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/beta"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_mean/Assign"
  op: "Assign"
  input: "hidden_1/bn_1/moving_mean"
  input: "hidden_1/bn_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_mean/read"
  op: "Identity"
  input: "hidden_1/bn_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 80
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 80
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_variance/Assign"
  op: "Assign"
  input: "hidden_1/bn_1/moving_variance"
  input: "hidden_1/bn_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/moving_variance/read"
  op: "Identity"
  input: "hidden_1/bn_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/mean/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/mean"
  op: "Mean"
  input: "hidden_1/add"
  input: "hidden_1/bn_1/moments/mean/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/StopGradient"
  op: "StopGradient"
  input: "hidden_1/bn_1/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/SquaredDifference"
  op: "SquaredDifference"
  input: "hidden_1/add"
  input: "hidden_1/bn_1/moments/StopGradient"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/variance/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/variance"
  op: "Mean"
  input: "hidden_1/bn_1/moments/SquaredDifference"
  input: "hidden_1/bn_1/moments/variance/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/Squeeze"
  op: "Squeeze"
  input: "hidden_1/bn_1/moments/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/moments/Squeeze_1"
  op: "Squeeze"
  input: "hidden_1/bn_1/moments/variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/switch_t"
  op: "Identity"
  input: "hidden_1/bn_1/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/switch_f"
  op: "Identity"
  input: "hidden_1/bn_1/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/Switch_1"
  op: "Switch"
  input: "hidden_1/bn_1/moments/Squeeze"
  input: "hidden_1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moments/Squeeze"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/Switch_2"
  op: "Switch"
  input: "hidden_1/bn_1/moving_mean/read"
  input: "hidden_1/bn_1/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond/Merge"
  op: "Merge"
  input: "hidden_1/bn_1/cond/Switch_2"
  input: "hidden_1/bn_1/cond/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/switch_t"
  op: "Identity"
  input: "hidden_1/bn_1/cond_1/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/switch_f"
  op: "Identity"
  input: "hidden_1/bn_1/cond_1/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/Switch_1"
  op: "Switch"
  input: "hidden_1/bn_1/moments/Squeeze_1"
  input: "hidden_1/bn_1/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moments/Squeeze_1"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/Switch_2"
  op: "Switch"
  input: "hidden_1/bn_1/moving_variance/read"
  input: "hidden_1/bn_1/cond_1/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_variance"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_1/Merge"
  op: "Merge"
  input: "hidden_1/bn_1/cond_1/Switch_2"
  input: "hidden_1/bn_1/cond_1/Switch_1:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/Switch"
  op: "Switch"
  input: "is_training"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/switch_t"
  op: "Identity"
  input: "hidden_1/bn_1/cond_2/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/switch_f"
  op: "Identity"
  input: "hidden_1/bn_1/cond_2/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/pred_id"
  op: "Identity"
  input: "is_training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/decay"
  op: "Const"
  input: "^hidden_1/bn_1/cond_2/switch_t"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub"
  op: "Sub"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub/Switch:1"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub/Switch_1:1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub/Switch"
  op: "Switch"
  input: "hidden_1/bn_1/moving_mean/read"
  input: "hidden_1/bn_1/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub/Switch_1"
  op: "Switch"
  input: "hidden_1/bn_1/cond/Merge"
  input: "hidden_1/bn_1/cond_2/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/cond/Merge"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/mul"
  op: "Mul"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/sub"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/decay"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg"
  op: "AssignSub"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/Switch:1"
  input: "hidden_1/bn_1/cond_2/AssignMovingAvg/mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@hidden_1/bn_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "hidden_1/bn_1/cond_2/AssignMovingAvg/Switch"
  op: "RefSwitch"
  input: "hidden_1/bn_1/moving_mean"
  input: "hidden_1/bn_1/cond_2/pred_id"
